import sys
sys.stdin=open('switch_input.txt')

#스위치개수=int(input())                        # 스위치 개수
#스위치상태=list(map(int,input().split()))         # 스위치 상태

#def mymin(a,b):                                 # 둘을 비교해서 작은 놈을 선택하는 함수
#    if a>=b:
#        mmin=b
#    else:
#        mmin=a
#    return mmin
#
#
#
#스위치번호와상태=[]
#for i in range(스위치개수):
#    스위치번호와상태.append([i,스위치상태[i]])      # 스위치 번호와 상태를 리스트로 저장
#
#
#학생수=int(input())
#
#성별과조작스위치번호=[]
#for _ in range(학생수):
#    성별,스위치번호=map(int,input().split())           
#    성별과조작스위치번호.append((성별, 스위치번호-1))                                      # 성별과 조작할 스위치 번호 저장
#
#대칭한쪽의길이=0
#for 인덱스 in range(len(성별과조작스위치번호)):                                         # 학생수만큼 조작
#
#    if 성별과조작스위치번호[인덱스][0]==1:                                              # 남성이면
#        for 조작인덱스 in range(성별과조작스위치번호[인덱스][1],스위치개수,성별과조작스위치번호[인덱스][1]+1):          # 받은 수의 배수들에 대해
#            if 스위치번호와상태[조작인덱스][1]==0:                                      # 0이면
#                스위치번호와상태[조작인덱스][1]=1                                       # 1로
#            elif 스위치번호와상태[조작인덱스][1]==1:                                    # 1이면
#                스위치번호와상태[조작인덱스][1]=0                                       # 0으로
#               
#
#    elif 성별과조작스위치번호[인덱스][0]==2:                                            # 여성이면
#        if 성별과조작스위치번호[인덱스][1]==0 or 성별과조작스위치번호[인덱스][1]==스위치개수-1: # 스위치가 양끝이면 자기만 바꿔준다.
#            if 스위치번호와상태[성별과조작스위치번호[인덱스][1]][1]==0:
#                스위치번호와상태[성별과조작스위치번호[인덱스][1]][1]=1
#            elif 스위치번호와상태[성별과조작스위치번호[인덱스][1]][1]==1:
#                스위치번호와상태[성별과조작스위치번호[인덱스][1]][1]=0
#        else:
#            for 이동인덱스 in range(1,mymin(스위치개수-성별과조작스위치번호[인덱스][1],성별과조작스위치번호[인덱스][1])):
#                if 스위치번호와상태[성별과조작스위치번호[인덱스][1]-이동인덱스][1]!=스위치번호와상태[성별과조작스위치번호[인덱스][1]+이동인덱스][1]:  # 대칭이 아닌 놈이 발견되면
#                    break
#                else:
#                    대칭한쪽의길이+=1
#
#            if 스위치번호와상태[성별과조작스위치번호[인덱스][1]][1]==0: 
#                스위치번호와상태[성별과조작스위치번호[인덱스][1]][1]=1
#            elif 스위치번호와상태[성별과조작스위치번호[인덱스][1]][1]==1:
#                스위치번호와상태[성별과조작스위치번호[인덱스][1]][1]=0
#
#            for 이동인덱스 in range(1,대칭한쪽의길이+1):
#                if 스위치번호와상태[성별과조작스위치번호[인덱스][1]-이동인덱스][1]==0:
#                    스위치번호와상태[성별과조작스위치번호[인덱스][1]-이동인덱스][1]=스위치번호와상태[성별과조작스위치번호[인덱스][1]+이동인덱스][1]=1
#                elif 스위치번호와상태[성별과조작스위치번호[인덱스][1]-이동인덱스][1]==1:
#                    스위치번호와상태[성별과조작스위치번호[인덱스][1]-이동인덱스][1]=스위치번호와상태[성별과조작스위치번호[인덱스][1]+이동인덱스][1]=0
#
#for i in range(스위치개수):
#    print(스위치번호와상태[i][1],end=' ')


n=int(input())
lst=[-1] + list(map(int,input().split()))
num_student=int(input())
n=len(lst)
def switch(index):
    if lst[index]==0:
        lst[index]=1
    else:
        lst[index]=1

for _ in range(num_student):
    gender,num=map(int,input().split())

    if gender==1:
        for i in range(num,n,num):
            switch(i)
    
    elif gender==2:
        switch(num)
        k=1
        while 1:
            if 0<=num-k and num+k<n and lst[num-k]==lst[num+k]:
                switch(num-k)
                switch(num+k)
                k+=1
            else:
                break

lst.pop(0)
for i in range(0,len(lst),20):
    print(*lst[i:i+20])
